linyuww/esp32-ornament/firmware/esp32-ornament/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024
CONFIG_ORNAMENT_HOSTNAME_PREFIX="codex-ornament"
CONFIG_ORNAMENT_MDNS_ENABLED=y
CONFIG_ORNAMENT_UI_FRAME_MS=250
CONFIG_ORNAMENT_STANDBY_CLOCK_MS=120000
CONFIG_ORNAMENT_ASRPRO_DONE_NOTIFY=y
CONFIG_ORNAMENT_ASRPRO_UART_NUM=1
CONFIG_ORNAMENT_ASRPRO_UART_BAUD=9600
CONFIG_ORNAMENT_ASRPRO_UART_TX_GPIO=17
CONFIG_ORNAMENT_ASRPRO_UART_RX_GPIO=-1
CONFIG_ORNAMENT_ASRPRO_DONE_TRIGGER="codex_done"
CONFIG_ORNAMENT_ASRPRO_DONE_SUFFIX=""
CONFIG_ORNAMENT_ASRPRO_TX_WAIT_MS=100
CONFIG_ORNAMENT_LCD_PIXEL_CLOCK_HZ=2000000
CONFIG_ORNAMENT_LCD_BL_ACTIVE_LEVEL=1
CONFIG_ORNAMENT_LCD_BOOT_TEST_MS=0
CONFIG_ORNAMENT_LCD_SWAP_COLOR_BYTES=y
CONFIG_ORNAMENT_LCD_SWAP_XY=y
# CONFIG_ORNAMENT_LCD_REFERENCE_TEST_ONLY is not set
